load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Spike"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-processor.js"
  variables:
    memberEmails:
      - "member1@futsal.com"
      - "member2@futsal.com"
      - "member5@futsal.com"
      - "member10@futsal.com"
      - "member20@futsal.com"
    adminEmails:
      - "admin@futsal.com"
    password: "password123"
    fields: [1, 2]
    timeSlots: [1, 2, 3, 4, 5, 6, 7]

scenarios:
  - name: "Homepage Traffic"
    weight: 40
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.title"
              as: "pageTitle"
          expect:
            - statusCode: 200

  - name: "Member Dashboard"
    weight: 30
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ memberEmails[0] }}"
            password: "{{ password }}"
          capture:
            - json: "$.message"
              as: "loginMessage"
      - get:
          url: "/dashboard"
          expect:
            - statusCode: 200
      - think: 5
      - get:
          url: "/dashboard"
          expect:
            - statusCode: 200

  - name: "Admin Dashboard"
    weight: 20
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ adminEmails[0] }}"
            password: "{{ password }}"
      - get:
          url: "/admin/dashboard"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/admin/dashboard?start_date=2025-10-01&end_date=2025-11-30"
          expect:
            - statusCode: 200

  - name: "Create Booking"
    weight: 10
    flow:
      - post:
          url: "/login"
          json:
            email: "{{ memberEmails[0] }}"
            password: "{{ password }}"
      - think: 2
      - post:
          url: "/bookings"
          json:
            field_id: "{{ fields[0] }}"
            time_slot_id: "{{ randomNumber(1, 7) }}"
            booking_date: "2025-11-15"
          expect:
            - statusCode: 302
      - think: 1